#### IM[自己是【001]

> 一个用户一个表、当用户长时间没有聊天【超过30天】则删除对应用户的表

#### 002

| id【自动增长】 | MsgType | Date           | Msg                    | uid【用户id】 | status    |
| -------------- | ------- | -------------- | ---------------------- | ------------- | --------- |
| 000000123      | 1       | 2018年03月31日 | 你好                   | 001           | 1【已读】 |
| 000000124      | 2       | 2018年03月30日 | /cdchat/002/xxxxxx.png | 002           | 1         |
|                |         |                | /cdchat/002/xxxxx.wav  | 002           | 0【未读】 |

#### 003

| id【自动增长】 | MsgType | Date           | Msg                    | uid【用户id】 | status |
| -------------- | ------- | -------------- | ---------------------- | ------------- | ------ |
| 000000123      | 1       | 2018年03月31日 | 你好                   | 001           | 0      |
| 000000124      | 2       | 2018年03月30日 | /cdchat/003/xxxxxx.png | 001           | 0      |
|                |         |                | /cdchat/003/xxxxx.wav  | 003           | 0      |


